//循环执行10次
//100~109
//1~10
//0~9
/*
var i=0;//1.初始值
while(i<10){//2.循环条件
  //循环体
  console.log(i);
  i++;//3.增量
}

//练习: 打印30~40之间所有的整数
var i=30;
while(i<=40){
  console.log(i);
  i++;
}

//练习：打印50 55 60 65 70 75 80
var i=50;
while(i<=80){
  console.log(i);
  //增量：每次加5
  i+=5;//i=i+5;
}

//练习:打印66 63 60 57 54 51
var i=66;
while(i>=51){
  console.log(i);
  i-=3;
}

//练习：打印1~100之间所有的奇数(使用if判断是否为奇数)
//1.循环产生1~100之间所有整数
var i=1;
while(i<=100){
  //2.打印奇数
  //i代表1~100之间所有的整数
  //判断i是否为奇数，如果是，打印
  if(i%2===1){
    console.log(i);
  }
  i++;
}

//练习: 计算1~100之间所有整数的和
//1.声明变量用于保存所有数字的和
var sum=0;
//2.产生1~100之间所有的整数
var i=1;
while(i<=100){
  //i代表1~100之间所有的整数
  //把i放入(加)到变量sum中
  //1+2+3....+100
  sum+=i;
  //每次加一次打印sum
  //console.log(sum);
  i++;
}
//打印最终sum的值
console.log(sum);

//练习: 计算1~100之间所有偶数的和
//1.声明变量保存和
var sum=0;
//2.循环产生1~100之间所有的偶数
var i=1;
while(i<=100){
  //判断i是否为偶数
  if(i%2===0){
    //把i的值加到sum中
	sum+=i;
  }
  i++;
}
console.log(sum);
*/
//阶乘  10!  10的阶乘
// 10!  10*9*8*7....*1
//练习: 使用循环计算10的阶乘
//1.初始化变量保存所有数字的乘积
var jc=1;
//2.循环产生10~1之间所有整数
var i=10;
while(i>=1){
  //i代表所有整数
  //3.把所有的整数乘以到jc
  //1*10*9*8...1
  jc*=i;
  i--;
}
console.log(jc);

//空字符串转数字
console.log( Number('1a') );




