//打印1~10之间所有整数
/*
for(var i=1;i<=10;i++){
  console.log(i);
}

//练习:打印80 75 70 65 60
for(var i=80;i>=60;i-=5){
  console.log(i);
}

//练习:计算1~100之间所有奇数的和
for(var i=1,sum=0;i<=100;i++){
  //判断i的值是否为奇数
  if(i%2===1){
    //把i加到sum中
	sum+=i;
  }
}
console.log(sum);

//练习: 计算1~20之间所有能被3整除的数字的乘积
for(var i=1,cj=1;i<=20;i++){
  //i代表所有的整数
  //判断是否能被3整除
  if(i%3===0){
    cj*=i;
  }
}
console.log(cj);

//练习: 打印2000~2100之间所有的闰年
//获取所有的年份
for(var i=2000;i<=2100;i++){
  //i所有的年份
  //判断i是否为闰年
  if(i%4===0 && i%100!==0 || i%400===0){
    console.log(i);
  }
}
*/
/*
1*1=1
1*2=2 2*2=4
1*3=3 2*3=6 3*3=9
1*5=5 2*5=10 3*5=15 4*5=20 5*5=25
*/
//12345
//循环产生1~5，拼接起来，最后打印 --16:15
for(var i=1,str='';i<=5;i++){
  //console.log(i);
  //str='1*5=2*5=3*5=4*5=5*5='
  str+=i+'*5='+i*5+' ';
}
console.log(str);


