/*
*     1  <=1   1    
**    1  <=2   1 2
***   1  <=3   1 2 3
****  1  <=4   1 2 3 4
***** 1  <=5   1 2 3 4 5
*/
/*
//循环5次
//外层：控制循环的行数
for(var j=1;j<=9;j++){
 //内层: 控制每一行的列数
 for(var i=1,str='';i<=9;i++){
  //循环体，重复的内容
  //str='*****'
  str+='*';
 }
 console.log(str);
}



//外层循环: 控制循环的行数
for(var i=1;i<=9;i++){
  //内层循环: 控制循环的列数
  //循环条件: 小于等于当前的行号
  for(var j=1,str='';j<=i;j++){
	 str+='*';
  }
  //每循环一行，打印一行
  console.log(str);
}
*/
/*
1*1=1
1*2=2 2*2=4
1*3=3 2*3=6 3*3=9
*/
//外层循环：循环的行数 i
for(var i=1;i<=9;i++){
  //内层循环: 循环的列数
  for(var j=1,str='';j<=i;j++){
    str+=j+'*'+i+'='+i*j+' ';
  }
  console.log(str);
}



