/*
9*9=81 8*9 7*9....1*9    9
8*8 7*8 6*8 .1*8      8
7                     7	
..
1                     1
*/
/*
//外层循环: 循环的行数(9~1)
for(var i=9;i>=1;i--){
  //内层循环: 循环的列数(n~1)
  for(var j=i,str='';j>=1;j--){
    str+=j+'*'+i+'='+i*j+' ';
  }
  //打印当前这一行
  console.log(str);
}

//打印本世纪（2000~2100）的前10个闰年
//用到变量来记录当前闰年的个数
for(var i=2000,sum=0;i<=2100;i++){
  if(i%4===0 && i%100!==0 || i%400===0){
    console.log(i);
	//如果是闰年，让sum的值加1
	sum++;
	//sum每加1判断是否为10，如果为10，结束循环
	if(sum===10){
	  break;
	}
  }
}
console.log(sum);
*/
//计算1~100之间所有整数的和，当和大于4000的时候，提前结束循环，打印当前的和
for(var i=1,sum=0;i<=100;i++){
  sum+=i;
  //每加一个值，判断是否大于4000，如果是，结束循环
  if(sum>4000){
    break;
  }
}
console.log(sum,i);



