//取余
//console.log( 5%2 );//1
//console.log( 2%5 );//2

//自增
/*
var a=1;
//在原来的基础之上加1
//a++;//2
//console.log(a);
//--------------1.开始--------------
//先打印a的值,a的值还是1,然后再执行自增，现在内存中存储a的值已经是2
console.log(a++);
//以上代码分两步
//1.console.log(a);
//2.a++;
//打印最新a的值
console.log(a);
//------------1.结束-------------

//-------------2.开始-------------
var a=1;
//先让a的值执行自增，然后再打印a的
console.log(++a);
//以上代码分为以下步骤
//1. a++;
//2. console.log(a);
*/

//-------------2.结束-------------
//自减
var b=5;
//在原来基础之上减1
//b--;
//console.log(b);


var num=3;
console.log(num++ + ++num);

